{
  "data": [
    {
      "node": {
        "id": 1,
        "title": "Attack on Titan",
        "title2": "Shingeki no Kyojin",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Spring 2013",
        "studio": "Wit Studio",
        "source": "Manga",
        "genres": "Action, Award Winning, Drama, Suspense",
        "scoreLeft": "8.541 (scored by 2,788,046 users)",
        "score": "8.54",
        "s3": "2,345,355,234 users",
        "rank": "#111",
        "popularity": "#1",
        "date": "Apr 7, 2013 to Sep 29, 2013",
        "support": "3,932,413",
        "synopsis": "Centuries ago, mankind was slaughtered to near extinction by monstrous humanoid creatures called Titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal Titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations.\n\nmankind was slaughtered to near extinction by monstrous humanoid creatures called Titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal Titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations.",
        "Background": "Shingeki no Kyojin adapts content from the first eight volumes of Hajime Isayama's award-winning manga of the same name. The anime won the Animation of the Year in the Television category at the Tokyo Anime Award Festival in 2014."
      }
    },
    {
      "node": {
        "id": 2,
        "title": "One Piece",
        "title2": "One Piece",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Currently Airing",
        "premiered": "Sundays at 09:30 (JST)",
        "studio": "Toei Animation",
        "source": "Manga",
        "genres": "Action, Adventure, Fantasy",
        "scoreLeft": "8.72",
        "score": "8.72",
        "s3": "1,331,522 users",
        "rank": "#52",
        "popularity": "#19",
        "date": "Oct 20, 1999 to ?",
        "support": "2,344,496",
        "synopsis": "Barely surviving in a barrel after passing through a terrible whirlpool at sea, carefree Monkey D. Luffy ends up aboard a ship under attack by fearsome pirates. Despite being a naive-looking teenager, he is not to be underestimated. Unmatched in battle, Luffy is a pirate himself who resolutely pursues the coveted One Piece treasure and the King of the Pirates title that comes with it.\n\nThe late King of the Pirates, Gol D. Roger, stirred up the world before his death by disclosing the whereabouts of his hoard of riches and daring everyone to obtain it. Ever since then, countless powerful pirates have sailed dangerous seas for the prized One Piece only to never return. Although Luffy lacks a crew and a proper ship, he is endowed with a superhuman ability and an unbreakable spirit that make him not only a formidable adversary but also an inspiration to many.\n\nAs he faces numerous challenges with a big smile on his face, Luffy gathers one-of-a-kind companions to join him in his ambitious endeavor, together embracing perils and wonders on their once-in-a-lifetime adventure.",
        "Background": "Several anime-original arcs have been adapted into light novels, and the series has inspired 50+ video games as of 2023.\n\nIn June 2004, One Piece was licensed in North America by 4Kids Entertainment, which partnered with Viz Media for home video distribution. As One Piece proved unsuitable for their target demographic, 4Kids Entertainment censored the show to meet their standards, and, in December 2006, they stopped its production. In April 2007, Funimation took over the series licensing, providing an uncut version that remained faithful to the original release.\n\nIn Japan, the anime's first 574 episodes were released exclusively on DVD by Avex Pictures from February 21, 2001, to December 4, 2013. Blu-rays also became available with the DVDs starting on January 8, 2014. In North America, Viz Media released the anime on DVD between February 28, 2006, and June 26, 2007. Funimation has re-released and continued the series since May 27, 2008. From March 23, 2021, the DVDs were accompanied by Blu-rays as well."
      }
    },
    {
      "node": {
        "id": 3,
        "title": "Fullmetal Alchemist: Brotherhood",
        "title2": "Brotherhood",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Spring 209",
        "studio": "Bones",
        "source": "Manga",
        "genres": " Action, Adventure, Drama, Fantasy",
        "scoreLeft": "8.541 (scored by 2,788,046 users)",
        "score": "9.09",
        "s3": "2,114,011 users",
        "rank": "#2",
        "popularity": "#3",
        "date": "Apr 5, 2009 to Jul 4, 2010",
        "support": "3,334,347",
        "synopsis": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor.\n\nThe brothers are rescued by their neighbor Pinako Rockbell and her granddaughter Winry. Known as a bio-mechanical engineering prodigy, Winry creates prosthetic limbs for Edward by utilizing 'automail,' a tough, versatile metal used in robots and combat armor. After years of training, the Elric brothers set off on a quest to restore their bodies by locating the Philosopher's Stone—a powerful gem that allows an alchemist to defy the traditional laws of Equivalent Exchange.\n\nAs Edward becomes an infamous alchemist and gains the nickname 'Fullmetal,' the boys' journey embroils them in a growing conspiracy that threatens the fate of the world'",
        "Background": "'Shingeki' no Kyojin adapts content from the first eight volumes of Hajime Isayama's award-winning manga of the same name. The anime won the Animation of the Year in the Television category at the Tokyo Anime Award Festival in 2014."
      }
    },
    {
      "node": {
        "id": 4,
        "title": "Death Note",
        "title2": "Death Note",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Fall 2006",
        "studio": "Madhouse",
        "source": "Manga",
        "genres": "Supernatural, Suspense",
        "scoreLeft": "8.621 (scored by 2,736,708 users)",
        "score": "8.62",
        "s3": "2,736,708 users",
        "rank": "#79",
        "popularity": "#2",
        "date": "Oct 4, 2006 to Jun 27, 2007",
        "support": "3,888,543",
        "synopsis": "Brutal murders, petty thefts, and senseless violence pollute the human world. In contrast, the realm of death gods is a humdrum, unchanging gambling den. The ingenious 17-year-old Japanese student Light Yagami and sadistic god of death Ryuk share one belief: their worlds are rotten.\n\nFor his own amusement, Ryuk drops his Death Note into the human world. Light stumbles upon it, deeming the first of its rules ridiculous: the human whose name is written in this note shall die. However, the temptation is too great, and Light experiments by writing a felon's name, which disturbingly enacts his first murder.\n\nAware of the terrifying godlike power that has fallen into his hands, Light—under the alias Kira—follows his wicked sense of justice with the ultimate goal of cleansing the world of all evil-doers. The meticulous mastermind detective L is already on his trail, but as Light's brilliance rivals L's, the grand chase for Kira turns into an intense battle of wits that can only end when one of them is dead.",
        "Background": "No background information has been added to this title."
      }
    },
    {
      "node": {
        "id": 5,
        "title": "One Punch Man",
        "title2": "ワンパンマン",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Fall 2015",
        "studio": "Madhouse",
        "source": "Manga",
        "genres": "Action, Comedy",
        "scoreLeft": "8.541 (scored by 2,788,046 users)",
        "score": "8.50",
        "s3": "2,228,387 users",
        "rank": "#131",
        "popularity": "#1",
        "date": "Oct 5, 2015 to Dec 21, 2015",
        "support": "3,207,684",
        "synopsis": "The seemingly unimpressive Saitama has a rather unique hobby: being a hero. In order to pursue his childhood dream, Saitama relentlessly trained for three years, losing all of his hair in the process. Now, Saitama is so powerful, he can defeat any enemy with just one punch. However, having no one capable of matching his strength has led Saitama to an unexpected problem—he is no longer able to enjoy the thrill of battling and has become quite bored.\n\nOne day, Saitama catches the attention of 19-year-old cyborg Genos, who witnesses his power and wishes to become Saitama's disciple. Genos proposes that the two join the Hero Association in order to become certified heroes that will be recognized for their positive contributions to society. Saitama, who is shocked that no one knows who he is, quickly agrees. Meeting new allies and taking on new foes, Saitama embarks on a new journey as a member of the Hero Association to experience the excitement of battle he once felt.",
        "Background": "Episodes 1 and 2 were previewed at a screening in Saitama city cultural center (small hall) on September 6, 2015. Regular broadcasting began on October 5, 2015.\n\nOne Punch Man is based on Yusuke Murata's manga remake of ONE's original web comic. The anime adapts the first seven volumes of the manga."
      }
    },
    {
      "node": {
        "id": 6,
        "title": "Boku no Hero Academia",
        "title2": "My Hero Acedemia",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Spring 2016",
        "studio": "Bones",
        "source": "Manga",
        "genres": " School, Super Power,Action, Award Winning, Drama, Suspense",
        "scoreLeft": "8.541 (scored by 2,788,046 users)",
        "score": "7.86",
        "s3": "2,060,734 users",
        "rank": "#856",
        "popularity": "#7",
        "date": " Apr 3, 2016 to Jun 26, 2016",
        "support": "3,012,198",
        "synopsis": "The appearance of quirks, newly discovered super powers, has been steadily increasing over the years, with 80 percent of humanity possessing various abilities from manipulation of elements to shapeshifting. This leaves the remainder of the world completely powerless, and Izuku Midoriya is one such individual.\n\nSince he was a child, the ambitious middle schooler has wanted nothing more than to be a hero. Izuku's unfair fate leaves him admiring heroes and taking notes on them whenever he can. But it seems that his persistence has borne some fruit: Izuku meets the number one hero and his personal idol, All Might. All Might's quirk is a unique ability that can be inherited, and he has chosen Izuku to be his successor!\n\nEnduring many months of grueling training, Izuku enrolls in UA High, a prestigious high school famous for its excellent hero training program, and this year's freshmen look especially promising. With his bizarre but talented classmates and the looming threat of a villainous organization, Izuku will soon learn what it really means to be a hero.",
        "Background": "Mangaka Horikoushi Kouhei has noted that American superhero comics are the inspiration for the series, and has based character pages on logos for Marvel and DC comic characters."
      }
    },
    {
      "node": {
        "id": 7,
        "title": "Kimetsu no Yaiba",
        "title2": "Demon Slayer: Kimetsu no Yaiba",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Spring 2019",
        "studio": " ufotable",
        "source": "Manga",
        "genres": "Action, Award Winning, Drama, Suspense",
        "scoreLeft": "8.47 (scored by 2,788,046 users)",
        "score": "8.47",
        "s3": "2,082,783 users",
        "rank": "#143",
        "popularity": "#6",
        "date": "Apr 6, 2019 to Sep 28, 2019",
        "support": "3,932,413",
        "synopsis": "CEver since the death of his father, the burden of supporting the family has fallen upon Tanjirou Kamado's shoulders. Though living impoverished on a remote mountain, the Kamado family are able to enjoy a relatively peaceful and happy life. One day, Tanjirou decides to go down to the local village to make a little money selling charcoal. On his way back, night falls, forcing Tanjirou to take shelter in the house of a strange man, who warns him of the existence of flesh-eating demons that lurk in the woods at night.\n\nWhen he finally arrives back home the next day, he is met with a horrifying sight—his whole family has been slaughtered. Worse still, the sole survivor is his sister Nezuko, who has been turned into a bloodthirsty demon. Consumed by rage and hatred, Tanjirou swears to avenge his family and stay by his only remaining sibling. Alongside the mysterious group calling themselves the Demon Slayer Corps, Tanjirou will do whatever it takes to slay the demons and protect the remnants of his beloved sister's humanity",
        "Background": "The anime covers chapters 1 to 53 of the manga.Kimetsu no Yaiba won the Animation of the Year award in the Television category at the Tokyo Anime Award Festival in 2020."
      }
    },
    {
      "node": {
        "id": 8,
        "title": "Naruto",
        "title2": "Naruto: Shippuden",
        "medium": "https://myanimelist.cnn-dena.com/images/anime/2/13083.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/2/13083l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Fall 2002 (Naruto), Fall 2007 (Naruto: Shippuden)",
        "studio": "Studio Pierrot",
        "source": "Manga",
        "genres": "Action, Adventure, Shounen",
        "scoreLeft": "8.32 (scored by 2,383,224 users)",
        "score": "8.32",
        "s3": "2,383,224 users",
        "rank": "#134",
        "popularity": "#4",
        "date": "Oct 3, 2002 to Feb 8, 2007 (Naruto), Feb 18, 2007 to Mar 23, 2017 (Naruto: Shippuden)",
        "support": "3,522,308",
        "synopsis": "Naruto Uzumaki, a mischievous adolescent ninja with an incorrigible knack for trouble, harbors an audacious dream: to become Hokage, the leader of his village and the pinnacle of ninja achievement. Naruto's path to Hokage is rife with hardship. Shunned by his peers for harboring the sealed spirit of the Nine-Tailed Fox, a monstrous entity that attacked Konohagakure, the Hidden Leaf Village, twelve years prior, Naruto strives to overcome the prejudice and become the village's hero. However, Naruto's journey is not a solitary one. Teamed with Sasuke Uchiha, a brooding prodigy consumed by vengeance, and Sakura Haruno, a budding kunoichi with a crush on Sasuke, Naruto embarks on countless missions, forging indelible bonds and facing formidable foes alongside his teammates. As Naruto and his companions hone their skills and confront dangerous adversaries, they unravel the mysteries of the sealed Nine-Tailed Fox and the shadowy organization that seeks to exploit its power.",
        "Background": "Naruto is an adaptation of the long-running manga series of the same name written and illustrated by Masashi Kishimoto. The manga was serialized in Shueisha's Weekly Shōnen Jump magazine from 1999 to 2014, and its chapters were later collected into 72 tankōbon volumes."
      }
    },
    {
      "node": {
        "title": "Hunter X Hunter",
        "title2": "",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/3/81220.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/3/81220l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Fall 2011 (2011 version), Fall 1999 (1999 version)",
        "studio": "Madhouse (2011 version), Nippon Animation (1999 version)",
        "source": "Manga",
        "genres": "Action, Adventure, Shounen",
        "scoreLeft": "8.92 (scored by 1,390,404 users)",
        "score": "8.92",
        "s3": "1,390,404 users",
        "rank": "#11",
        "popularity": "#16",
        "date": "Oct 2, 2011 to Sep 24, 2014 (2011 version), Oct 16, 1999 to Mar 31, 2001 (1999 version)",
        "support": "2,084,423",
        "synopsis": "In a world brimming with Hunters, individuals who possess extraordinary abilities utilized through Nen, twelve-year-old Gon Freecss sets out on a journey to find his father, Ging, who is himself a world-renowned Hunter. Missing for years, Ging left nothing but a single Hunter license and a lingering aura of mystery. To become a Hunter and follow in his father's footsteps, Gon embarks on a rigorous test to obtain his own Hunter license. Along the way, he befriends the eccentric Killua Zoldyck, a young prodigy assassin from a notorious family of assassins; Kurapika, the sole survivor of his clan who vows vengeance against the Scarlet Eyes; and Leorio Paladiknight, a hopeful doctor seeking the funds to fulfill his dream. Throughout their perilous adventures, Gon and his companions face formidable opponents, unearth hidden secrets, and unravel the true meaning of being a Hunter.",
        "Background": "Hunter X Hunter is an adaptation of the manga series of the same name written and illustrated by Yoshihiro Togashi. The manga was serialized in Shueisha's Weekly Shōnen Jump magazine from 1998 to 2006, with several hiatuses, and its chapters were later collected into 32 tankōbon volumes."
      }
    },
    {
      "node": {
        "title": "Your Name",
        "title2": "Kimi no Na wa.",
        "medium": "[invalid URL removed]",
        "large": "[invalid URL removed]",
        "type": "Movie",
        "status": "Finished Airing",
        "premiered": "Aug 26, 2016",
        "studio": "CoMix Wave Films",
        "source": "Original",
        "genres": "Drama, Fantasy, Romance",
        "scoreLeft": "8.87 (scored by 2,291,582 users)",
        "score": "8.87",
        "s3": "2,291,582 users",
        "rank": "#7",
        "popularity": "#11",
        "date": "Aug 26, 2016",
        "support": "3,377,304",
        "synopsis": "Mitsuha Miyamizu, a high school girl yearning for life in the bustling city of Tokyo, finds her world turned upside down when she begins mysteriously switching bodies with Taki Tachibana, a teenage boy living in Tokyo. Disoriented by their swapped realities, Mitsuha and Taki must navigate their altered lives and unravel the strange phenomenon that has entangled them. Through written messages left on each other's phones and notebooks, they strive to maintain normalcy in their swapped lives. Yet, as the frequency of their body swaps increases, they face the looming possibility that their connection might have a deeper meaning. A tender yet bittersweet story unfolds as Mitsuha and Taki yearn to meet the stranger whose life they've become inexplicably intertwined with.",
        "Background": "Your Name is an original anime film written and directed by Makoto Shinkai, known for his visually stunning and emotionally resonant works. The film was produced by CoMix Wave Films and distributed by Toho. It received widespread critical acclaim for its animation, emotional impact, and exploration of themes of connection, identity, and the passage of time."
      }
    },
    {
      "node": {
        "title": "Dangers in My Heart",
        "title2": "Dangers in My Heart",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Spring 2022",
        "studio": "Studio XYZ",
        "source": "Manga",
        "genres": "Romance, Drama",
        "scoreLeft": "7.89 (scored by 100,245 users)",
        "score": "7.89",
        "s3": "100,245 users",
        "rank": "#298",
        "popularity": "#512",
        "date": "Apr 3, 2022 to Jun 26, 2022",
        "support": "145,267",
        "synopsis": "In a bustling city where dreams and ambitions collide, two individuals find themselves entangled in a complex web of emotions. Haruka, a determined young woman with a troubled past, crosses paths with Yuuki, a charismatic but enigmatic figure harboring his own secrets.\n\nAs they navigate the tumultuous waters of love and relationships, Haruka and Yuuki must confront their fears, insecurities, and the societal pressures that threaten to tear them apart. Will their love blossom amidst the dangers lurking in their hearts, or will fate conspire to keep them apart forever?",
        "Background": "Dangers in My Heart is based on the manga of the same name written and illustrated by [Author Name]. The manga was serialized in [Magazine Name] and has garnered a dedicated fanbase for its compelling story and well-developed characters."
      }
      
    },
    {
      "node": {
        "title": "Ninja Kamui",
        "title2": "Ninja Kamui",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Winter 1985",
        "studio": "Studio ABC",
        "source": "Manga",
        "genres": "Action, Adventure, Historical",
        "scoreLeft": "7.56 (scored by 50,987 users)",
        "score": "7.56",
        "s3": "50,987 users",
        "rank": "#625",
        "popularity": "#987",
        "date": "Feb 6, 1985 to Apr 1, 1986",
        "support": "78,342",
        "synopsis": "In the tumultuous era of feudal Japan, a lone ninja warrior embarks on a perilous journey of vengeance and redemption. Kamui, a skilled and deadly assassin, forsakes his clan and vows to protect the innocent from the tyranny of corrupt warlords and oppressive regimes.\n\nFueled by a burning desire for justice, Kamui traverses treacherous landscapes, battles formidable adversaries, and confronts his own inner demons along the way. With his razor-sharp wit and unparalleled combat prowess, he becomes a symbol of hope for the downtrodden and a force to be reckoned with by his enemies.\n\nBut as Kamui delves deeper into the shadows of his past, he uncovers dark secrets that threaten to consume him whole. Will he succumb to the darkness within, or will he rise above it to become the legendary ninja he was destined to be?",
        "Background": "Ninja Kamui is an adaptation of the manga series 'Kamui Den' by Sanpei Shirato, which was serialized from 1965 to 1967. The manga is renowned for its historical setting, intricate plot, and complex characters, making it a classic in the ninja genre."
      }
      
    },
    {
      "node": {
        "title": "Captain Tsubasa 2023",
        "title2": "Captain Tsubasa 2023",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Spring 2023",
        "studio": "Studio ABC",
        "source": "Manga",
        "genres": "Sports, Shounen",
        "scoreLeft": "8.25 (scored by 20,000 users)",
        "score": "8.25",
        "s3": "20,000 users",
        "rank": "#75",
        "popularity": "#92",
        "date": "Apr 1, 2023 to Jun 30, 2023",
        "support": "30,000",
        "synopsis": "Captain Tsubasa 2023 continues the iconic football saga of Tsubasa Ozora, a young and talented footballer with dreams of becoming the greatest player in the world. Joined by his friends and teammates, Tsubasa faces off against formidable opponents, overcomes personal challenges, and strives to lead his team to victory on the global stage.\n\nWith breathtaking matches, heart-pounding moments, and unforgettable goals, Captain Tsubasa 2023 captures the spirit of friendship, teamwork, and determination that defines the beautiful game of football.",
        "Background": "No background information has been added to this title."
      }
      
    },
    {
      "node": {
        "title": "Yami Shibai 12",
        "title2": "Yami Shibai 12",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Summer 2023",
        "studio": "Studio XYZ",
        "source": "Original",
        "genres": "Horror, Supernatural",
        "scoreLeft": "7.88 (scored by 5,000 users)",
        "score": "7.88",
        "s3": "5,000 users",
        "rank": "#150",
        "popularity": "#211",
        "date": "Jul 1, 2023 to Sep 30, 2023",
        "support": "8,000",
        "synopsis": "Yami Shibai 12 delves into the realm of urban legends and ghost stories, weaving spine-chilling tales that will send shivers down your spine. Each episode presents a new horror story, told in the traditional Japanese kamishibai style, with eerie visuals and unsettling narratives that linger long after the screen fades to black.\n\nFrom vengeful spirits to cursed objects, Yami Shibai 12 explores the darker side of human nature and the supernatural forces that lurk in the shadows. Prepare to be captivated and terrified as you journey into the twisted world of Yami Shibai.",
        "Background": "No background information has been added to this title."
      }
      
    },
    {
      "node": {
        "title": "Mashle: Magic and Muscles",
        "title2": "Mashle: Magic and Muscles",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Spring 2023",
        "studio": "Studio XYZ",
        "source": "Manga",
        "genres": "Action, Comedy, Fantasy",
        "scoreLeft": "8.15 (scored by 15,000 users)",
        "score": "8.15",
        "s3": "15,000 users",
        "rank": "#90",
        "popularity": "#135",
        "date": "Apr 1, 2023 to Jun 30, 2023",
        "support": "22,000",
        "synopsis": "Mashle: Magic and Muscles follows the adventures of Mash Burnedead, a young man born into a world where magic reigns supreme. Despite being born without an ounce of magical ability, Mash possesses superhuman strength that rivals even the most powerful wizards.\n\nDetermined to prove that strength can triumph over magic, Mash enrolls in the prestigious Easton Magic Academy, where he must navigate a world of spells, potions, and enchanted beings. Along the way, he forms unlikely friendships, faces formidable foes, and uncovers the truth behind his mysterious past.\n\nWith his indomitable spirit and unwavering resolve, Mash embarks on a quest to defy destiny and carve his own path to greatness.",
        "Background": "No background information has been added to this title."
      }
      
    },
    {
      "node": {
        "title": "Solo Leveling",
        "title2": "Solo Leveling",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Winter 2024",
        "studio": "Studio XYZ",
        "source": "Web manga",
        "genres": "Action, Adventure, Fantasy",
        "scoreLeft": "9.25 (scored by 500,000 users)",
        "score": "9.25",
        "s3": "500,000 users",
        "rank": "#10",
        "popularity": "#5",
        "date": "Jan 1, 2024 to Mar 31, 2024",
        "support": "700,000",
        "synopsis": "Solo Leveling follows the story of Sung Jin-Woo, a low-ranked hunter in a world where monsters and dungeons threaten humanity. After a mysterious incident in a dungeon, Jin-Woo gains the ability to see quest log-like screens and level up as if in a video game.\n\nDetermined to become stronger and protect those he cares about, Jin-Woo embarks on a journey of self-discovery and growth. As he delves deeper into dungeons and battles powerful monsters, Jin-Woo uncovers dark secrets about the world and his own past.\n\nWith breathtaking action scenes, compelling character development, and an immersive world, Solo Leveling takes readers on an epic adventure filled with twists",
        "Background": "Solo Leveling is adapted from the web novel series of the same name written by Chu-Gong. The web novel was later serialized into a webtoon by KakaoPage and has gained a massive following worldwide for its addictive storyline and stunning artwork."
      }
    },

    {
      "node": {
        "title": "Sousou no Frieren",
        "title2": "Sousou no Frieren",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Spring 2023",
        "studio": "Studio XYZ",
        "source": "Manga",
        "genres": "Fantasy, Adventure, Slice of Life",
        "scoreLeft": "8.50 (scored by 10,000 users)",
        "score": "8.50",
        "s3": "10,000 users",
        "rank": "#35",
        "popularity": "#78",
        "date": "Apr 1, 2023 to Jun 30, 2023",
        "support": "15,000",
        "synopsis": "Sousou no Frieren follows the story of Frieren, an ancient and powerful sorceress who embarks on a journey to explore the world and experience life to the fullest. Along the way, she forms an unlikely bond with a group of adventurers and discovers the true meaning of friendship, love, and happiness.\n\nWith breathtaking vistas, heartwarming moments, and epic battles, Sousou no Frieren takes viewers on an unforgettable adventure filled with wonder, excitement, and emotion.",
        "Background": "No background information has been added to this title."
      }
      
    },
    {
      "node": {
        "title": "Boruto",
        "title2": "Boruto",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Ongoing",
        "premiered": "Spring 201",
        "genres": "Action, Adventure",
        "scoreLeft": "7.53 (scored by 250,000 users)",
        "score": "7.53",
        "s3": "250,000 users",
        "rank": "#180",
        "popularity": "#200",
        "date": "Apr 5, 2017 to Ongoing",
        "support": "300,000",
        "synopsis": "Boruto follows the journey of Boruto Uzumaki, son of Naruto Uzumaki, the Seventh Hokage of the Hidden Leaf Village. Unlike his father who was a troublemaker in his youth, Boruto aspires to become a ninja like Sasuke Uchiha, Naruto's close friend and mentor. However, Boruto faces his own set of challenges as he navigates through the ever-changing world of ninjas, filled with new threats and mysteries.\n\nWith the support of his friends and mentors, including Sarada Uchiha and Mitsuki, Boruto embarks on missions, faces dangerous foes, and uncovers dark secrets that threaten the peace of the ninja world. Along the way, he learns valuable lessons about friendship, loyalty, and the true meaning of being a ninja.\n\nAs Boruto strives to carve his own path and surpass his father's legacy, he must confront his inner demons and overcome the obstacles that stand in his way.",
        "Background": "Boruto: Naruto Next Generations is a sequel and spin-off of the original Naruto manga series, created by Masashi Kishimoto. The manga, written by Ukyo Kodachi and illustrated by Mikio Ikemoto, began serialization in Weekly Shōnen Jump in May 2016. The anime adaptation, produced by Studio Pierrot, premiered in April 2017 and continues to air, exploring new adventures in the Naruto universe."
      }
      
      },
    {
      "node": {
        "title": "Classroom of the Elite",
        "title2": "Classroom of the Elite",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Summer 2017",
        "studio": "Studio XYZ",
        "source": "Light novel",
        "genres": "Psychological, Slice of Life, School, Drama",
        "scoreLeft": "8.12 (scored by 300,000 users)",
        "score": "8.12",
        "s3": "300,000 users",
        "rank": "#60",
        "popularity": "#90",
        "date": "Jul 12, 2017 to Sep 27, 2017",
        "support": "450,000",
        "synopsis": "Classroom of the Elite takes place at Koudo Ikusei Senior High School, an elite institution where students are given unprecedented freedom and resources to excel academically and socially. However, beneath the school's prestigious facade lies a dark and twisted hierarchy, where students are pitted against each other in a ruthless competition for supremacy.\n\nEnter Kiyotaka Ayanokouji, a reserved and enigmatic student who prefers to observe from the shadows. As he navigates the cutthroat world of Koudo Ikusei, Kiyotaka forms unlikely alliances, exposes hidden agendas, and uncovers the sinister truth behind the school's facade.\n\nWith its thought-provoking themes, complex characters, and suspenseful plot twists, Classroom of the Elite offers a gripping exploration of human nature, social dynamics, and the pursuit of excellence.",
        "Background": "Classroom of the Elite is based on the light novel series written by Shōgo Kinugasa and illustrated by Shunsaku Tomose. The light novel began serialization in 2015 and has since gained a dedicated fanbase for its unique premise and compelling storytelling."
      }      
    },
    {
      "node": {
        "title": "Apothecary Diaries",
        "title2": "Apothecary Diaries",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Winter 2024",
        "studio": "Studio XYZ",
        "source": "Manga",
        "genres": "Historical, Mystery, Seinen",
        "scoreLeft": "8.45 (scored by 50,000 users)",
        "score": "8.45",
        "s3": "50,000 users",
        "rank": "#30",
        "popularity": "#45",
        "date": "Jan 1, 2024 to Mar 31, 2024",
        "support": "70,000",
        "synopsis": "Apothecary Diaries follows the story of Maomao, an apothecary with a keen eye and sharp wit, as she navigates the intrigue and danger of the imperial court in ancient China. Despite her lowly status as a servant, Maomao possesses unparalleled knowledge of herbs and poisons, making her invaluable to those in power.\n\nAs she tends to the health and ailments of the imperial family and nobility, Maomao uncovers dark secrets, political machinations, and hidden agendas that threaten the stability of the empire. With her cunning mind and fearless spirit, Maomao becomes embroiled in a deadly game of cat and mouse, where one wrong move could cost her everything.\n\nWith its rich historical setting, intricate plot twists, and compelling characters, Apothecary Diaries offers a captivating glimpse into the world of ancient China and the lives of those who shaped its destiny.",
        "Background": "Apothecary Diaries is adapted from the manga series of the same name written by Natsu Hyuuga and illustrated by Nekokurage. The manga began serialization in 2017 and has gained critical acclaim for its engaging story and detailed artwork."
      }
      
    },
    
      {
        "title": "Doctor Stone",
        "title2": "",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/17/86623.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/17/86623l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Summer 2019",
        "studio": "TMS Entertainment",
        "source": "Manga",
        "genres": "Adventure, Sci-Fi",
        "scoreLeft": "8.53 (scored by 1,237,824 users)",
        "score": "8.53",
        "s3": "1,237,824 users",
        "rank": "#33",
        "popularity": "#25",
        "date": "Jul 5, 2019 to Dec 13, 2019",
        "support": "1,842,321",
        "synopsis": "In a flash of blinding light, humanity is petrified by a mysterious phenomenon. Thousands of years later, Senku Ishigami, a science-obsessed teenager, awakens to find himself in a stone world. Civilization is gone, and remnants of humanity are but statues. Armed with his vast knowledge of science, Senku sets out to rebuild society. He starts with his childhood friend Taiju Oogami, a hot-headed but loyal young man. Together, they begin the monumental task of reviving humanity from its stony slumber. Through scientific ingenuity and unwavering determination, Senku strives to bring back the world he once knew. However, the path to revival is fraught with challenges. A cunning and power-hungry individual named Tsukasa Shishio emerges, seeking to build a new world order in his own image. A clash of ideals ensues, forcing Senku to confront the very foundation of civilization.",
        "Background": "Doctor Stone is an adaptation of the manga series of the same name written by Riichiro Inagaki and illustrated by Boichi. The manga is serialized in Shueisha's Weekly Shōnen Jump magazine and has been collected into 25 tankōbon volumes as of April 14, 2024."
      },
      {
        "node":{
        "title": "Naruto: Shippuden",
        "title2": "",
        "medium": "https://myanimelist.cnn-dena.com/images/anime/2/13083.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/2/13083l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Fall 2007",
        "studio": "Studio Pierrot",
        "source": "Manga",
        "genres": "Action, Adventure, Shounen",
        "scoreLeft": "8.32 (scored by 2,383,224 users)",
        "score": "8.32",
        "s3": "2,383,224 users",
        "rank": "#134",
        "popularity": "#4",
        "date": "Feb 18, 2007 to Mar 23, 2017",
        "support": "3,522,308",
        "synopsis": "Naruto Uzumaki, having achieved the rank of chunin and honed his skills alongside his teammates, Sasuke Uchiha and Sakura Haruno, now faces new challenges. A sinister organization known as Akatsuki emerges, seeking to capture the tailed beasts, including the Nine-Tailed Fox sealed within Naruto. With the fate of the ninja world hanging in the balance, Naruto and his comrades embark on perilous missions to thwart Akatsuki's plans. Meanwhile, Sasuke, consumed by vengeance for his brother's death, grows increasingly distant from his friends and pursues a dark path of power. As Naruto strives to become Hokage, the leader of his village, and protect his bonds with his friends, he must confront not only external threats but also the darkness brewing within Sasuke.",
        "Background": "Naruto: Shippuden is the sequel to the anime series Naruto and an adaptation of the latter half of Masashi Kishimoto's manga series of the same name. It premiered in 2007 and continued the story of Naruto Uzumaki and his companions two and a half years after the fight with Sasuke"
        }
      },
    
    {
      "node": {
        "title": "Vinland Saga",
        "title2": "",
        "medium": "[invalid URL removed]",
        "large": "[invalid URL removed]",
        "type": "TV",
        "status": "Finished Airing (2 Seasons)",
        "premiered": "Summer 2019 (Season 1), Winter 2023 (Season 2)",
        "studio": "Wit Studio (Season 1), MAPPA (Season 2)",
        "source": "Manga",
        "genres": "Adventure, Epic, Historical",
        "scoreLeft": "8.77 (scored by 1,184,522 users)",
        "score": "8.77",
        "s3": "1,184,522 users",
        "rank": "#18",
        "popularity": "#14",
        "date": "Jul 7, 2019 to Dec 29, 2019 (Season 1), Jan 9, 2023 to Mar 27, 2023 (Season 2)",
        "support": "1,724,310",
        "synopsis": "In the harsh lands of Iceland at the turn of the millennium, young Thorfinn longs for a life of adventure away from the battlefield. His dreams are shattered when his peaceful life is disrupted by the arrival of a band of mercenaries led by the cunning Askeladd. Witnessing the death of his father, Thors, at the hands of Askeladd, Thorfinn vows revenge and dedicates his life to becoming a skilled warrior. He joins Askeladd's band, embarking on a perilous journey through wartorn England. As Thorfinn grows stronger and grapples with his thirst for vengeance, he encounters a cast of characters, each with their own motivations and struggles. Through his encounters, Thorfinn begins to question the true meaning of strength and the path he has chosen. Will he find solace in revenge, or can he forge a new destiny in the fabled land of Vinland, a place said to be untouched by war?",
        "Background": "Vinland Saga is an adaptation of the ongoing manga series of the same name written and illustrated by Makoto Yukimura. The anime series is divided into two seasons, with the first season produced by Wit Studio and the second season produced by MAPPA."
        }
    },
    {
      "node": {
        "title": "My Hero Academia",
        "title2": "",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/3/85191.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/3/85191l.jpg",
        "type": "TV",
        "status": "Currently Airing (6 Seasons)",
        "premiered": "Spring 2016",
        "studio": "Bones",
        "source": "Manga",
        "genres": "Action, Adventure, Comedy, Sci-Fi",
        "scoreLeft": "8.47 (scored by 1,943,112 users)",
        "score": "8.47",
        "s3": "1,943,112 users",
        "rank": "#44",
        "popularity": "#1",
        "date": "Apr 3, 2016 to Present",
        "support": "2,874,231",
        "synopsis": "In a world where a majority of the population possesses superpowers, known as Quirks, Izuku Midoriya dreams of one day becoming a Hero – an admired individual who saves others. However, unlike most, Izuku was born Quirkless. Yet, his determination does not waver. One fateful day, he encounters All Might, the world's greatest Hero, and inherits his power – One For All. Now, with newfound strength, Izuku enrolls in U.A. High, a prestigious academy that nurtures the next generation of Heroes. Izuku, surrounded by his talented classmates, begins his journey towards becoming a true Hero, facing rigorous training, villainous threats, and the looming shadow of a powerful organization.",
        "Background": "My Hero Academia is an adaptation of the ongoing manga series of the same name written and illustrated by Kohei Horikoshi. The manga is serialized in Shueisha's Weekly Shōnen Jump magazine and has been collected into 33 tankōbon volumes as of April 14, 2024."
      }
    },
    {
      "node": {
        "title": "Tokyo Ghoul",
        "title2": "",
        "medium": "[invalid URL removed]",
        "large": "[invalid URL removed]",
        "type": "TV",
        "status": "Finished Airing (4 Seasons)",
        "premiered": "Spring 2014",
          "studio": "Studio Pierrot (Season 1 & √A), ufotable (Season 2 & :re)",
        "source": "Manga",
        "genres": "Action, Dark Fantasy, Horror, Mystery, Psychological",
        "scoreLeft": "7.81 (scored by 1,392,121 users)",
        "score": "7.81",
        "s3": "1,392,121 users",
        "rank": "#234",
        "popularity": "#122",
        "date": "Apr 4, 2014 to Sep 24, 2018",
        "support": "2,043,218",
        "synopsis": "In Tokyo, where Ghouls, horrifying creatures that devour humans, exist in the shadows, Ken Kaneki, an ordinary college student, finds his life turned upside down after a date takes a gruesome turn. Attacked by a Ghoul, Kaneki barely survives the encounter but is left with a permanent scar and a newfound craving for human flesh. Transformed into a half-Ghoul by undergoing an organ transplant from the very Ghoul who attacked him, Kaneki is thrust into the dark world of Ghouls. He struggles to control his new hunger and finds refuge with the coffee shop 'Anteiku,' where he learns to co-exist with other Ghouls and survive as a one-eyed Ghoul in a society that fears and hunts them.",
        "Background": "Tokyo Ghoul is an adaptation of the manga series of the same name written and illustrated by Sui Ishida. The anime series consists of four seasons, with the first two seasons following the storyline of the original manga and the latter two seasons deviating significantly. The original manga was serialized in Shueisha's Weekly Shōnen Jump magazine and later transferred to their"}  
    },
{
  "node": {
    "title": "Jujutsu Kaisen",
    "title2": "",
    "medium": "https://myanimelist.cdn-dena.com/images/anime/18/97378.jpg",
    "large": "https://myanimelist.cdn-dena.com/images/anime/18/97378l.jpg",
    "type": "TV",
    "status": "Finished Airing (1 Season)",
    "premiered": "Fall 2020",
    "studio": "MAPPA",
    "source": "Manga",
    "genres": "Action, Adventure, Dark Fantasy, Shounen",
    "scoreLeft": "8.72 (scored by 1,824,310 users)",
    "score": "8.72",
    "s3": "1,824,310 users",
    "rank": "#8",
    "popularity": "#3",
    "date": "Oct 2, 2020 to Mar 27, 2021",
    "support": "2,731,420",
    "synopsis": "In a world where cursed spirits haunt the everyday lives of humans, unseen by most, a secret society of Jujutsu Sorcerers exists to combat these malevolent entities. Yuji Itadori, a high school student with exceptional physical strength, unknowingly swallows a powerful cursed object – the finger of Ryomen Sukuna, a King of Curses. Now, fate has turned him into a half-human, half-curse being himself! Exorcism is the only way to eliminate Sukuna, but meaning Yuji must join the Tokyo Jujutsu High School and partner with other sorcerers to embark on a perilous mission, facing deadly curses and unveiling the hidden strength within him.",
    "Background": "Jujutsu Kaisen is an adaptation of the ongoing manga series of the same name written and illustrated by Gege Akutami. The manga is serialized in Shueisha's Weekly Shōnen Jump magazine and has been collected into 20 tankōbon volumes as of April 14, 2024."
  }
  
  },
  {
  "node": {
    "title": "Chainsaw Man",
    "title2": "",
    "medium": "https://myanimelist.cdn-dena.com/images/anime/18/112323.jpg",
    "large": "https://myanimelist.cdn-dena.com/images/anime/18/112323l.jpg",
    "type": "TV",
    "status": "Finished Airing (1 Season)",
    "premiered": "Fall 2022",
    "studio": "MAPPA",
    "source": "Manga",
    "genres": "Action, Adventure, Comedy, Dark Fantasy, Horror, Shounen",
    "scoreLeft": "8.43 (scored by 1,124,301 users)",
    "score": "8.43",
    "s3": "1,124,301 users",
    "rank": "#53",
    "popularity": "#7",
    "date": "Oct 11, 2022 to Dec 13, 2022",
    "support": "1,631,209",
    "synopsis": "In a world ravaged by Devils – monstrous entities born from human fears – Denji, a down-on-his-luck teenager, has hit rock bottom. Burdensome debts inherited from his deceased father and the constant threat of violence dictate his bleak reality. To make ends meet, Denji resorts to working as a Devil Hunter alongside Pochita, a chainsaw-wielding Devil resembling a small dog. Pochita serves as both his loyal companion and his weapon in a brutal world where humans form contracts with Devils to utilize their powers.\n\nTheir life takes a gruesome turn when Denji is betrayed by the Yakuza, merging with Pochita in a desperate act of survival. Reborn as a Devil-Human hybrid, Denji possesses the horrifying ability to transform parts of his body into chainsaws. With newfound power and a contract with the Public Safety Devil Hunters, Denji is offered a new lease on life. Now, his motivation is simple – to have a decent meal, a warm place to sleep, and maybe even a girlfriend. But the world of Devil Hunters is fraught with danger. Denji must face formidable opponents, navigate the complex hierarchies within the organization, and grapple with the dark secret of his newfound power. As he fights for a sliver of normalcy, Denji uncovers the truth about the Chainsaw Man, a legendary Devil feared by both humans and Devils alike. Will Denji control his monstrous abilities or succumb to the darkness within?",
    "Background": "Chainsaw Man is an adaptation of the ongoing manga series of the same name written and illustrated by Tatsuki Fujimoto. The manga is serialized in Shueisha's Shōnen Jump+ online magazine and has been collected into 12 tankōbon volumes as of April 14, 2024. Chainsaw Man is known for its graphic violence, dark humor, and exploration of themes like poverty, desperation, and the human condition."
  }
  
},
    {
      "node": {
        "id": 1,
        "title": "Attack on Titan",
        "title2": "Shingeki no Kyojin",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/6/73245.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/6/73245l.jpg",
        "type": "TV",
        "status": "Finished Airing",
        "premiered": "Spring 2013",
        "studio": "Wit Studio",
        "source": "Manga",
        "genres": "Action, Award Winning, Drama, Suspense",
        "scoreLeft": "8.541 (scored by 2,788,046 users)",
        "score": "8.54",
        "s3": "2,345,355,234 users",
        "rank": "#111",
        "popularity": "#1",
        "date": "Apr 7, 2013 to Sep 29, 2013",
        "support": "3,932,413",
        "synopsis": "Centuries ago, mankind was slaughtered to near extinction by monstrous humanoid creatures called Titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal Titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations.\n\nmankind was slaughtered to near extinction by monstrous humanoid creatures called Titans, forcing humans to hide in fear behind enormous concentric walls. What makes these giants truly terrifying is that their taste for human flesh is not born out of hunger but what appears to be out of pleasure. To ensure their survival, the remnants of humanity began living within defensive barriers, resulting in one hundred years without a single titan encounter. However, that fragile calm is soon shattered when a colossal Titan manages to breach the supposedly impregnable outer wall, reigniting the fight for survival against the man-eating abominations.",
        "Background": "Shingeki no Kyojin adapts content from the first eight volumes of Hajime Isayama's award-winning manga of the same name. The anime won the Animation of the Year in the Television category at the Tokyo Anime Award Festival in 2014."
      }
    },
    {
      "node": {
        "title": "Bleach",
        "title2": "",
        "medium": "https://myanimelist.cdn-dena.com/images/anime/2/13081.jpg",
        "large": "https://myanimelist.cdn-dena.com/images/anime/2/13081l.jpg",
        "type": "TV",
        "status": "Finished Airing (366 Episodes)",
        "premiered": "Fall 2004",
        "studio": "Studio Pierrot",
        "source": "Manga",
        "genres": "Action, Adventure, Fantasy, Shounen, Supernatural",
        "scoreLeft": "8.14 (scored by 2,231,208 users)",
        "score": "8.14",
        "s3": "2,231,208 users",
        "rank": "#102",
        "popularity": "#11",
        "date": "Oct 5, 2004 to Mar 27, 2012",
        "support": "3,241,320",
        "synopsis": "Ichigo Kurosaki is not your ordinary teenager. He can see ghosts. When his family is attacked by a Hollow, a malevolent spirit that consumes souls, Ichigo encounters Rukia Kuchiki, a Soul Reaper – a warrior tasked with guiding departed souls to the afterlife and protecting humanity from Hollows. During their encounter, Rukia is severely injured, and Ichigo, in a desperate attempt to save his family, accepts her powers. However, this act binds his fate to the world of the Soul Society – the realm where departed souls reside.\n\nNow, Ichigo is thrust into the role of a substitute Soul Reaper, battling Hollows and safeguarding the innocent alongside Rukia and his classmates, Uryu Ishida, a Quincy (a human who can wield spiritual power), and Orihime Inoue, a compassionate girl with a mysterious ability to heal. As Ichigo delves deeper into the supernatural world, he faces formidable adversaries, confronts the complexities of Soul Reaper society, and unlocks the true potential of his latent powers. The journey is fraught with challenges, forcing Ichigo to question the nature of life and death, the responsibility that comes with wielding immense power, and the unwavering bonds of friendship.",
        "Background": "Bleach is an adaptation of the manga series of the same name written and illustrated by Tite Kubo. The manga was serialized in Shueisha's Weekly Shōnen Jump magazine and has been collected into 74 tankōbon volumes. The anime series, produced by Studio Pierrot, aired for 366 episodes, covering the majority of the manga's storyline. In March 2020, it was announced that the manga's final story arc, 'Thousand-Year Blood War,' would receive a new anime adaptation, premiering in October 2022."
      }
      
    },
    {
      "node": {
        "title": "Black Clover",
        "title2": "",
        "medium": "[invalid URL black cover anime ON MyAnimeList myanimelist.net]",
        "large": "[invalid URL black cover anime ON MyAnimeList myanimelist.net]",
        "type": "TV",
        "status": "Finished Airing (170 Episodes)",
        "premiered": "Fall 2017",
        "studio": "Pierrot",
        "source": "Manga",
        "genres": "Action, Adventure, Fantasy, Magic, Shounen",
        "scoreLeft": "7.27 (scored by 1,123,411 users)",
        "score": "7.27",
        "s3": "1,123,411 users",
        "rank": "#724",
        "popularity": "#98",
        "date": "Oct 3, 2017 to Mar 30, 2021",
        "support": "1,832,104",
        "synopsis": "In a world steeped in magic, Asta, a young boy born without a single ounce of magical power, dreams of becoming the Wizard King, the most powerful mage in the kingdom. Surrounded by those who wield incredible magical abilities, Asta stands out as an anomaly. Yet, his unwavering determination and unwavering spirit refuse to be cowed. When a grimoire bestowal ceremony grants his childhood friend, Yuno, a spectacular grimoire, Asta remains empty-handed. However, fueled by his burning ambition, Asta unlocks a grimoire unlike any other – a five-leaf clover grimoire that houses the power of Anti-Magic!+\n\nNow, Asta embarks on a challenging journey alongside Yuno, joining the ranks of the Magic Knights, a group of mages who protect the kingdom. Despite the ridicule and prejudice he faces for his lack of magic, Asta never gives up. He hones his physical strength and wielding his Anti-Magic, vowing to prove his worth and surpass the magical prodigy, Yuno. Together, they embark on thrilling adventures, face formidable opponents, and unravel the mysteries of the magic world. Asta's unwavering spirit and determination inspire those around him, proving that magic isn't everything – the power of hard work, self-belief, and camaraderie can overcome any obstacle on the path to achieving one's dreams.\n,Black Clover is an adaptation of the manga series of the same name written and illustrated by Yūki Tabata. The manga was serialized in Shueisha's Weekly Shōnen Jump magazine from February 2015 to August 2023 and has been collected into 36 tankōbon volumes. The anime series, produced by Pierrot, aired for 170 episodes, faithfully adapting a significant portion of the manga's storyline."
      }
      
    },
    {
      "node": {
        "title": "One Piece Film: Red",
        "title2": "",
        "medium": "[IMAGE one piece film red poster]",
        "large": "[IMAGE one piece film red poster]",
        "type": "Movie",
        "status": "Released",
        "premiered": "August 6, 2022 (Japan), November 4, 2022 (North America)",
        "studio": "Toei Animation",
        "source": "One Piece",
        "genres": "Action, Adventure, Fantasy, Musical",
        "score": "N/A",
        "date": "August 6, 2022 (Japan)",
        "support": "N/A",
        "synopsis": "Uta, the most beloved singer in the world, renowned for concealing her own identity when performing, announces her first live concert. Luffy and the Straw Hat Pirates set sail for Elegia, the island where the concert is held, to witness Uta's legendary performance. However, the joyous event takes a drastic turn when it's revealed that Uta is Shanks' daughter. As Luffy reunites with a familiar face from his past, a shocking revelation throws the world into chaos. Now, entangled in a web of secrets involving the enigmatic Uta and the powerful Red-Haired Shanks, Luffy and his crew must navigate a thrilling musical adventure filled with challenges and heart-wrenching choices.\n\nOne Piece Film: Red is the fifteenth feature film in the One Piece franchise, celebrating the 25th anniversary of the original manga. The film is directed by Gorō Taniguchi and produced by Toei Animation. While not part of the official One Piece canon, the story is overseen by series creator Eiichiro Oda."
      }
    },
    {
    "node": {
      "title": "Jujutsu Kaisen 0",
      "title2": "Jujutsu Kaisen 0: The Movie",
      "medium": "Image URL not available",
      "large": "Image URL not available",
      "type": "Movie",
      "status": "Finished Airing",
      "premiered": "Winter 2021",
      "studio": "MAPPA",
      "source": "Manga",
      "genres": "Action, Supernatural, School, Shounen",
      "scoreLeft": "7.8 (scored by 37,000 users)",
      "score": "7.8",
      "s3": "37,000 users",
      "rank": "N/A",
      "popularity": "N/A",
      "date": "Dec 24, 2021",
      "support": "N/A",
      "synopsis": "Jujutsu Kaisen 0 follows Yuta Okkotsu, a high school student who gains control of an extremely powerful cursed spirit and gets enrolled in the Tokyo Prefectural Jujutsu High School by Jujutsu Sorcerers. The movie explores his journey as he learns to control the cursed spirit and navigates his new life at the school.\n\nJujutsu Kaisen 0 is a prequel to the Jujutsu Kaisen series and is based on the manga of the same name by Gege Akutami. The film was directed by Sunghoo Park and produced by MAPPA, featuring a screenplay by Hiroshi Seko. It was released in Japan on December 24, 2021, and has been praised for its storytelling and animated fight sequences."
    }
    
    },
    {
      "node": {
        "title": "Demon Slayer: Kimetsu no Yaiba – The Movie: Mugen Train",
        "title2": "Demon Slayer: Mugen Train",
        "medium": "N/A",
        "large": "N/A",
        "type": "Movie",
        "status": "Finished Airing",
        "premiered": "Fall 2020",
        "studio": "Ufotable",
        "source": "Manga",
        "genres": "Action, Historical, Supernatural, Shounen",
        "scoreLeft": "8.70 (scored by 400,000 users)",
        "score": "8.70",
        "s3": "400,000 users",
        "rank": "N/A",
        "popularity": "N/A",
        "date": "Oct 16, 2020",
        "support": "N/A",
        "synopsis": "Set after the events of the anime's first season, 'Demon Slayer: Mugen Train' follows Tanjiro Kamado and his companions Zenitsu Agatsuma and Inosuke Hashibira, along with Tanjiro's sister Nezuko, who is a demon. They embark on a perilous journey aboard the Mugen Train, where they join forces with the Flame Hashira, Kyojuro Rengoku, to face the demon Enmu, Lower Rank One of the Twelve Kizuki. As they battle the demon's sinister traps and illusions that prey on their deepest fears and desires, the Demon Slayers must draw upon their strength and determination to protect the passengers and defeat the demon.\n\nDemon Slayer: Mugen Train is a direct sequel to the first season of the 'Demon Slayer: Kimetsu no Yaiba' anime series. The film adapts the 'Mugen Train' arc from the manga series written by Koyoharu Gotouge. Directed by Haruo Sotozaki and produced by the renowned studio Ufotable, the movie was released during the COVID-19 pandemic and achieved significant commercial success, becoming the highest-grossing film of 2020 with over $507 million worldwide. It also set several box office records, including becoming the highest-grossing Japanese film of all time, surpassing 'Spirited Away'. The film's success has been attributed to its compelling storytelling, stunning animation, and emotional depth, resonating with audiences globally."
      }
    },
    {
      "node": {
        "title": "Suzume",
        "title2": "Suzume no Tojimari",
        "medium": "N/A",
        "large": "N/A",
        "type": "Movie",
        "status": "Finished Airing",
        "premiered": "Fall 2022",
        "studio": "CoMix Wave Films",
        "source": "Original",
        "genres": "Adventure, Drama, Supernatural",
        "scoreLeft": "8.31 (scored by 341,347 users)",
        "score": "8.31",
        "s3": "341,347 users",
        "rank": "N/A",
        "popularity": "N/A",
        "date": "Nov 11, 2022",
        "support": "N/A",
        "synopsis": "Suzume's journey begins in a quiet town in Kyushu when she encounters a mysterious young man searching for a peculiar door. As curiosity leads her to an abandoned onsen, she finds a lone door standing ajar. Upon opening it, Suzume is greeted by a starlit vista she can observe but not enter. This act inadvertently releases a keystone, unleashing calamities across Japan. Teaming up with the young man, Souta Munakata, Suzume must traverse disaster-stricken areas to seal these doors and halt the ensuing chaos. Along the way, she confronts her own past and learns the significance of connections and closures.\n\nDirected by Makoto Shinkai, 'Suzume' or 'Suzume no Tojimari' is a coming-of-age tale that intertwines personal growth with fantastical elements. The film's narrative is inspired by the 2011 Tōhoku earthquake and tsunami, reflecting on themes of disaster, recovery, and hope. With its stunning animation and emotional depth, 'Suzume' has garnered critical acclaim, securing its place as the fourth highest-grossing Japanese film of all time and earning a nomination for Best Animated Feature at the 81st Golden Globe Awards."
      }
      
    },
    {
      "node": {
        "title": "The Tale of the Princess Kaguya",
        "title2": "Kaguya-hime no Monogatari",
        "medium": "N/A",
        "large": "N/A",
        "type": "Movie",
        "status": "Finished Airing",
        "premiered": "Fall 2013",
        "studio": "Studio Ghibli",
        "source": "Folktale",
        "genres": "Fantasy, Historical, Supernatural",
        "scoreLeft": "8.25 (scored by 150,000 users)",
        "score": "8.25",
        "s3": "150,000 users",
        "rank": "N/A",
        "popularity": "N/A",
        "date": "Nov 23, 2013",
        "support": "N/A",
        "synopsis": "Discovered inside a shining stalk of bamboo by an old bamboo cutter and his wife, a tiny girl grows rapidly into an exquisite young lady. The mysterious young princess enthralls all who encounter her, but ultimately she must confront her fate, the punishment for her crime. 'The Tale of the Princess Kaguya' is Isao Takahata's final film and a poignant reimagining of the ancient Japanese folktale 'The Tale of the Bamboo Cutter'.\n\nDirected by Isao Takahata and produced by Studio Ghibli, 'The Tale of the Princess Kaguya' is an adaptation of the 10th-century Japanese literary tale known as 'The Tale of the Bamboo Cutter'. It was released on November 23, 2013, and is notable for being one of the most expensive Japanese films ever made, with a production budget of $49.3 million. The film received critical acclaim, including an Academy Award nomination for Best Animated Feature at the 87th Academy Awards. It is celebrated for its unique art style, emotional storytelling, and as the final film directed by Takahata before his death in April 2018."
      }
      
    },
    {
      "node": {
        "title": "Weathering with You",
        "title2": "Tenki no Ko",
        "medium": "N/A",
        "large": "N/A",
        "type": "Movie",
        "status": "Finished Airing",
        "premiered": "Summer 2019",
        "studio": "CoMix Wave Films",
        "source": "Original",
        "genres": "Drama, Fantasy, Romance",
        "scoreLeft": "8.28 (scored by 994,210 users)",
        "score": "8.28",
        "s3": "994,210 users",
        "rank": "N/A",
        "popularity": "N/A",
        "date": "July 19, 2019",
        "support": "N/A",
        "synopsis": "In the summer of high schooler Hodaka Morishima's runaway journey to Tokyo, he finds every day to be a rainy one. Struggling to find work and a place in the bustling city, his life changes when he meets Hina Amano, a kind-hearted girl with the mysterious ability to control the weather. As they spend more time together, Hodaka discovers that Hina's powers come at a cost, and the pair must make difficult decisions about their future. 'Weathering with You' is a tale of youth, love, and the ephemeral nature of life, set against the backdrop of an unusually rainy Tokyo.\n\n'Weathering with You' is a Japanese animated romantic fantasy film directed by Makoto Shinkai, who also wrote the screenplay. Produced by CoMix Wave Films and distributed by Toho, it features the voices of Kotaro Daigo and Nana Mori. The film was released in Japan on July 19, 2019, and received positive reviews for its animation, screenplay, music, and emotional weight. It grossed over $193.8 million worldwide, becoming the highest-grossing Japanese film of 2019 and the seventh highest-grossing anime film of all time. The film was selected as the Japanese entry for Best International Feature Film at the 92nd Academy Awards and received multiple Annie Award nominations."
      }
      
    },
    {
      "node": {
        "title": "My Hero Academia: Heroes Rising",
        "title2": "Boku no Hīrō Akademia za Mūbī: Hīrōzu:Raijingu",
        "medium": "N/A",
        "large": "N/A",
        "type": "Movie",
        "status": "Finished Airing",
        "premiered": "Winter 2019",
        "studio": "Bones",
        "source": "Original",
        "genres": "Action, Super Power, Shounen",
        "scoreLeft": "8.0 (scored by 200,000 users)",
        "score": "8.0",
        "s3": "200,000 users",
        "rank": "N/A",
        "popularity": "N/A",
        "date": "Dec 20, 2019",
        "support": "N/A",
        "synopsis": "In 'My Hero Academia: Heroes Rising', the students of U.A. High School's Class 1-A have been sent to Nabu Island as part of a safety program. Here, they must provide hero support and keep the peace in the absence of other pro heroes. However, their visit coincides with the arrival of a new villain, Nine, who seeks a particular quirk to fulfill his plans of creating a society where only those with strong quirks prevail. As Nine and his gang attack the island, it's up to Midoriya and his friends to take a stand and protect the inhabitants of Nabu Island from this new threat.\n\nDirected by Kenji Nagasaki and written by Yōsuke Kuroda, 'My Hero Academia: Heroes Rising' is the second film in the 'My Hero Academia' series. The movie features an original story that takes place after the Meta Liberation Army arc of the manga. It includes elements that were initially intended to be part of the manga's finale. Released in Japan on December 20, 2019, and in North America on February 26, 2020, the film was well-received by fans and critics alike, grossing over $29.9 million worldwide. It was broadcast on CN India on December 10, 2023, and is followed by a third film, 'My Hero Academia: World Heroes' Mission', and a fourth film, 'My Hero Academia: You're Next', set to be released on August 2, 2024."
      }
    },
    {
      "node": {
        "title": "Dragon Ball Super: Broly",
        "title2": "Doragon Bōru Sūpā: Burorī",
        "medium": "N/A",
        "large": "N/A",
        "type": "Movie",
        "status": "Finished Airing",
        "premiered": "Winter 2018",
        "studio": "Toei Animation",
        "source": "Manga",
        "genres": "Action, Adventure, Fantasy, Martial Arts, Super Power, Shounen",
        "scoreLeft": "7.9 (scored by 250,000 users)",
        "score": "7.9",
        "s3": "250,000 users",
        "rank": "N/A",
        "popularity": "N/A",
        "date": "Dec 14, 2018",
        "support": "N/A",
        "synopsis": "Dragon Ball Super: Broly is an action and adventure anime that follows the adventures of Goku and Vegeta as they face a powerful enemy named Broly. Throughout the story, surprising revelations about Goku and Vegeta's past are unveiled as they prepare for an epic battle against Broly, a legendary warrior with unrivaled power. With breathtaking animation and exciting fights, this anime promises high-quality entertainment for Dragon Ball fans.\n\nDragon Ball Super: Broly is the 20th Dragon Ball movie and the first under the Dragon Ball Super banner. It was released in Japan on December 14, 2018, and in North America on January 16, 2019. The movie is canonical in the history of Dragon Ball, being supervised by the creator Akira Toriyama. Broly's story has been revamped and his character has been reintroduced into the main universe of Dragon Ball. The movie reveals more about the Saiyans' past, including the planet Vegeta and King Vegeta. Dragon Ball Super: Broly presents the first canonical appearance of Gogeta, the fusion between Goku and Vegeta. The movie was acclaimed for the quality of the animation and fight scenes, being considered one of the best in the franchise."
      }
    },
    {
      "node": {
        "title": "Only Yesterday",
        "title2": "Omoide Poroporo",
        "medium": "N/A",
        "large": "N/A",
        "type": "Movie",
        "status": "Finished Airing",
        "premiered": "Summer 1991",
        "studio": "Studio Ghibli",
        "source": "Manga",
        "genres": "Drama, Romance, Slice of Life",
        "scoreLeft": "7.44 (scored by 146,606 users)",
        "score": "7.44",
        "s3": "146,606 users",
        "rank": "N/A",
        "popularity": "N/A",
        "date": "July 20, 1991",
        "support": "N/A",
        "synopsis": "Taeko Okajima is a 27-year-old, independent woman who has lived her entire life in Tokyo. Seeking to unwind from city life, she decides to visit her family in the countryside during the safflower harvest. On the train, Taeko's memories as a schoolgirl in the early stages of puberty come flooding back. A young farmer named Toshio picks her up at the station, and they quickly develop a friendship. During her stay, Taeko forms strong bonds with family and friends, learning the contrasts between urban and rural life, as well as the struggles and joys of farming. 'Only Yesterday' is a nostalgic and bittersweet journey of an adult woman coming to terms with her childhood dreams and the person she has become.\n\n'Only Yesterday' is a 1991 Japanese animated drama film directed by Isao Takahata and produced by Toshio Suzuki. Based on the manga by Hotaru Okamoto and Yuko Tone, it explores a genre traditionally thought to be outside the realm of animated subjects: a realistic drama written for adults, particularly women. The film was a surprise box office success, becoming the highest-grossing Japanese film of 1991 in the country. To celebrate its 25th anniversary, GKIDS released the film for the first time in an English-language format in 2016."
      }
    },
    {
      "node":{
        "title": "Grave of the Fireflies",
        "title2": "Hotaru no Haka",
        "medium": "N/A",
        "large": "N/A",
        "type": "Movie",
        "status": "Finished Airing",
        "premiered": "Spring 1988",
        "studio": "Studio Ghibli",
        "source": "Novel",
        "genres": "Drama, Historical",
        "scoreLeft": "8.52 (scored by 673,965 users)",
        "score": "8.52",
        "s3": "673,965 users",
        "rank": "N/A",
        "popularity": "N/A",
        "date": "April 16, 1988",
        "support": "N/A",
        "synopsis": "Set in Kobe, Japan, during the final months of World War II, 'Grave of the Fireflies' tells the heart-wrenching tale of two siblings, Seita and Setsuko, who are left to fend for themselves after losing their parents. The film portrays their struggle for survival amidst the chaos of war, dealing with starvation, loss, and the harsh realities of a world torn apart by conflict. Despite the darkness surrounding them, the bond between the brother and sister shines as a beacon of hope and love.\n\n'Grave of the Fireflies' is a 1988 Japanese animated war drama film directed by Isao Takahata and produced by Studio Ghibli. It is based on the 1967 semi-autobiographical short story of the same name by Akiyuki Nosaka. The film is universally acclaimed and has been ranked as one of the greatest war films of all time. It is recognized as a major work of Japanese animation, reflecting on the devastating impact of war and the resilience of the human spirit."
      }
      
    },
    {
      "node": {
        "id": 459,
        "title": "One Piece Movie 1",
        "main_picture": {
          "medium": "https://myanimelist.cdn-dena.com/images/anime/5/20925.jpg",
          "large": "https://myanimelist.cdn-dena.com/images/anime/5/20925l.jpg"
        }
      }
    }
  ],
  "paging": {
    "next": "https://api.myanimelist.net/v2/anime?offset=4&q=one&limit=4"
  }
}